In [1]:
# 반올림
# round 함수: DataFrame 객체 내의 요소를 반올림
# DataFrame.round(decimals=0, args, kwargs)
# df.round(decimals=0, args, kwargs)

In [2]:
import pandas as pd
import numpy as np

In [3]:
col = ['col1','col2','col3']
row = ['row1','row2','row3']
data = np.random.rand(3,3)*100
df = pd.DataFrame(data=data, index=row, columns=col)
df

           col1       col2       col3
row1  21.004232  19.150256  97.060322
row2  59.823715  37.995464  30.890678
row3  89.332508  85.117327  37.379382

In [4]:
df.round(0) # 일의 자리까지 반올림

      col1  col2  col3
row1  21.0  19.0  97.0
row2  60.0  38.0  31.0
row3  89.0  85.0  37.0

In [6]:
df.round(2) # 소수 2번째 자리까지 반올림

       col1   col2   col3
row1  21.00  19.15  97.06
row2  59.82  38.00  30.89
row3  89.33  85.12  37.38

In [8]:
df.round(-1) # 10의 -1승 자리까지 반올림

      col1  col2   col3
row1  20.0  20.0  100.0
row2  60.0  40.0   30.0
row3  90.0  90.0   40.0

In [9]:
# 합계
# sum: 객체의 행이나 열의 총 합계를 구하는 메서드
# DataFrame.sum(axis=None, skipna=None, level=None, 
#               numeric_only=None, min_count=0, kwargs)

In [10]:
col = ['col1','col2','col3']
row = ['row1','row2','row3']
data = [[1,2,3],[4,5,6],[7,np.NaN,9]]
df = pd.DataFrame(data=data,index=row,columns=col)
df

      col1  col2  col3
row1     1   2.0     3
row2     4   5.0     6
row3     7   NaN     9

In [11]:
# axis를 설정하여 더하기
df.sum(axis=0)

col1    12.0
col2     7.0
col3    18.0
dtype: float64

In [12]:
df.sum(axis=1)

row1     6.0
row2    15.0
row3    16.0
dtype: float64

In [13]:
# NaN이 포함되는 경우 skipna=False일 경우 NaN을 반환
df.sum(axis=0, skipna=False)

col1    12.0
col2     NaN
col3    18.0
dtype: float64

In [14]:
# 계산에 필요한 숫자의 최소 갯수를 설정하여 계산하기
# min_count : 계산에 필요한 숫자의 최소 갯수
df.sum(axis=1, min_count=3) # 이 경우 skipna가 True인 경우에도 NaN을 출력

row1     6.0
row2    15.0
row3     NaN
dtype: float64